gimsAPI/app/controllers/api/v1/products_controller.rb

INSERT INTO `products` (`name`, `description`, `price`, `min_amount`, `created_at`, `updated_at`, `user_id`, `category`) VALUES ('carrot', 'this is carrot', 12.0, 10, '2020-11-21 21:10:33', '2020-11-21 21:10:33', 2, '\"this\"')
---
      def create
        @product = Product.new(product_params)
        if @product.save