gimsAPI/app/controllers/api/v1/sessions_controller.rb

			def create
				@user = User.find_by(email: params[:email].downcase)
---
SELECT  `users`.* FROM `users` WHERE `users`.`email` = 'admin@gims.com' LIMIT 1