gimsAPI/app/controllers/api/v1/users_controller.rb

			def index
				#@users = User.where(activated: true).paginate(page: params[:page])
				@users = User.all
---
SELECT `users`.* FROM `users`

			def create
				@user = User.new(user_params)
				if @user.save
---
INSERT INTO `users` (`name`, `email`, `created_at`, `updated_at`, `password_digest`, `user_type`) VALUES ('Hamza Hassan', 'hamza@email.com', '2020-11-05 14:16:19', '2020-11-05 14:16:19', '$2a$10$mwijy/b9pKQGo2Bt/4J6KOtNngzj45ie/NoNP2WaK1Y4FNG297xb2', 'Manufacturer')